app/controllers/emails_controller.rb

  def create
    @email = Email.new(email_params)

    respond_to do |format|
      if @email.save
---
INSERT INTO "emails" ("objet", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["objet", "e"], ["body", "e"], ["created_at", "2018-08-23 20:06:29.977927"], ["updated_at", "2018-08-23 20:06:29.977927"]]

  def destroy
    @email.destroy
---
DELETE FROM "emails" WHERE "emails"."id" = ?  [["id", 2]]

    def set_email
      @email = Email.find(params[:id])
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]