app/views/emails/destroy.js.erb

DELETE FROM "emails" WHERE "emails"."id" = ?  [["id", 2]]
---

$(document).ready(function() {

  $('.delete_email').bind('ajax:success', function() {
     $(this).closest('tr').fadeOut();
  });


  });